app/controllers/buy_loads_controller.rb

SELECT "buy_loads".* FROM "buy_loads"
---
  def index
    @buy_loads = BuyLoad.all