app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def payment
    @user = User.find(params[:id[0]])
    send_prev = @user.balance
    @user.update( balance: send_prev.to_f - params[:balance].to_f )

    @user = 0

    @user = User.find(params[:id[1]])