app/controllers/users_controller.rb

INSERT INTO "users" ("f_name", "l_name", "email", "contact_num", "address", "balance", "user_type", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create_customer
      @user = User.new
      @user.f_name = params[:user][:f_name].capitalize
      @user.l_name = params[:user][:l_name].capitalize
      @user.birthday = params[:user][:birthday]
      @user.role = nil
      @user.merchant_name = nil
      @user.owner_fname = nil
      @user.owner_lname = nil
      @user.email = params[:user][:email]
      @user.contact_num = params[:user][:contact_num]
      @user.address = params[:user][:address]
      @user.balance = 0.0
      @user.user_type = "C"
      @user.password = params[:user][:password_digest]
      #all fields that should be null (nil) or 0
       @user.save

INSERT INTO "users" ("merchant_name", "owner_fname", "owner_lname", "email", "contact_num", "address", "balance", "user_type", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create_merchant
      @user = User.new
      @user.f_name = nil
      @user.l_name = nil
      @user.birthday = nil
      @user.role = nil
      @user.password = params[:user][:password_digest]
      @user.merchant_name = params[:user][:merchant_name].capitalize
      @user.owner_fname = params[:user][:owner_fname].capitalize
      @user.owner_lname = params[:user][:owner_lname].capitalize
      @user.email = params[:user][:email]
      @user.contact_num = params[:user][:contact_num]
      @user.address = params[:user][:address]
      @user.balance = 0.0
      @user.user_type = "M"
      #all fields that should be null (nil) or 0
     @user.save

INSERT INTO "users" ("f_name", "l_name", "role", "email", "contact_num", "address", "balance", "user_type", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create_admin
      @user = User.new(user_params)
      @user.f_name = params[:user][:f_name].capitalize
      @user.l_name = params[:user][:l_name].capitalize
      @user.birthday = nil
      @user.role = params[:user][:role].capitalize
      @user.password = params[:user][:password_digest]
      @user.merchant_name = nil
      @user.owner_fname = nil
      @user.owner_lname = nil
      @user.email = params[:user][:email]
      @user.contact_num = params[:user][:contact_num]
      @user.address = params[:user][:address]
      @user.balance = 0.0
      @user.user_type = "A"
      @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def qrreader
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "role" = ?, "merchant_name" = ?, "owner_fname" = ?, "owner_lname" = ?, "user_type" = ?, "birthday" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", ""], ["merchant_name", ""], ["owner_fname", ""], ["owner_lname", ""], ["user_type", "A"], ["birthday", "2019-08-03"], ["updated_at", "2019-08-03 06:23:56.744090"], ["id", 1]]
INSERT INTO "users" ("f_name", "l_name", "birthday", "role", "merchant_name", "owner_fname", "owner_lname", "email", "contact_num", "address", "balance", "user_type", "created_at", "updated_at", "password") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def buyload
    @user = User.find(params[:id])
    prev_balance = @user.balance
    @user.update( balance: prev_balance.to_f + params[:balance].to_f )

    @transaction = Transaction.new()
    @transaction.send_id = current_user.id
    @transaction.recv_id = params[:id]
    @transaction.card_id = nil
    @transaction.purchase_type = "Buy Load"
    @transaction.amount = params[:balance].to_f
    @transaction.time_recorded = DateTime.now
    @transaction.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "balance" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["balance", 1000.0], ["updated_at", "2019-08-22 09:31:28.930128"], ["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "f_name" = ?, "l_name" = ?, "role" = ?, "user_type" = ?, "password" = ?, "birthday" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["f_name", ""], ["l_name", ""], ["role", ""], ["user_type", "A"], ["password", 123546], ["birthday", "2019-08-19"], ["updated_at", "2019-08-19 03:58:22.925002"], ["id", 6]]
INSERT INTO "transactions" ("send_id", "recv_id", "purchase_type", "amount", "time_recorded", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def payment
    @user = User.find(current_user.id)
        if @user.balance.to_f > params[:balance].to_f
            send_prev = @user.balance
            @user.update( balance: send_prev.to_f - params[:balance].to_f )

            @user = 0

            @user = User.find(params[:id])
            recv_prev = @user.balance
            @user.update( balance: recv_prev.to_f + params[:balance].to_f )
            puts @user.errors.full_messages

            @transaction = Transaction.new()
            @transaction.send_id = current_user.id
            @transaction.recv_id = params[:id]
            @transaction.card_id = nil
            @transaction.purchase_type = "Send Load"
            @transaction.amount = params[:balance].to_f
            @transaction.time_recorded = DateTime.now
            @transaction.save

INSERT INTO "users" ("f_name", "l_name", "birthday", "role", "merchant_name", "owner_fname", "owner_lname", "email", "contact_num", "address", "balance", "user_type", "created_at", "updated_at", "password") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "merchant_name" = ?, "owner_fname" = ?, "owner_lname" = ?, "password" = ?, "birthday" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["merchant_name", ""], ["owner_fname", ""], ["owner_lname", ""], ["password", 123412], ["birthday", "2019-08-24"], ["updated_at", "2019-08-24 02:33:05.066169"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)